Конфигурация/Reports/РегламентированныйОтчетБалансРСБУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>РегламентированныйОтчетБалансРСБУ</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/InformationRegisters/ЗначенияДополнительныхСведений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияДополнительныхСведений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ДополнительныеСведения</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеСведения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Reports/РегламентированныйОтчетБалансРСБУ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ТаблицаФормОтчета() Экспорт
	
	ОписаниеТиповСтрока = Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(254));
	ОписаниеТиповБулево = Новый ОписаниеТипов("Булево");
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("Дата"));
	ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));
	
	ТаблицаФормОтчета = Новый ТаблицаЗначений;
	ТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",					ОписаниеТиповСтрока);
	ТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",				ОписаниеТиповСтрока, "Утверждена",  20);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия",			ОписаниеТиповДата,   "Действует с", 5);
	ТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",				ОписаниеТиповДата,   "         по", 5);
	ТаблицаФормОтчета.Колонки.Добавить("РедакцияФормы",					ОписаниеТиповСтрока, "Редакция формы", 20);
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета					= "ФормаОтчета_07100001";
	НоваяФорма.ОписаниеОтчета				= "Утверждена Приказом Министерства финансов Российской Федерации от 02.07.2010 № 66н (в ред. Приказов Минфина России от 05.10.2011 № 124н, от 06.04.2015 №57н, от 06.03.2018 №41н)";
	НоваяФорма.РедакцияФормы				= "от 06.03.2018 №41н";
	НоваяФорма.ДатаНачалоДействия			= '20110101';
	НоваяФорма.ДатаКонецДействия			= '20190531';
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета					= "ФормаОтчета_07100001";
	НоваяФорма.ОписаниеОтчета				= "Утверждена Приказом Министерства финансов Российской Федерации от 02.07.2010 № 66н (в ред. Приказов Минфина России от 05.10.2011 № 124н, от 06.04.2015 №57н, от 06.03.2018 №41н, от 19.04.2019 №61н)";
	НоваяФорма.РедакцияФормы				= "от 19.04.2019 №61н";
	НоваяФорма.ДатаНачалоДействия			= '20190601';
	НоваяФорма.ДатаКонецДействия			= '20241231';     
	
	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета					= "ФормаОтчета_07100001_2025";
	НоваяФорма.ОписаниеОтчета				= "Утверждена Приказом Министерства финансов Российской Федерации от 04.10.2023 № 157н";
	НоваяФорма.РедакцияФормы				= "от 04.10.2023 №157н";
	НоваяФорма.ДатаНачалоДействия			= '20250101'; 
	НоваяФорма.ДатаКонецДействия			= КонсолидированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));

	НоваяФорма = ТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета					= "ФормаОтчета_07100001_2025СРасшифровкой"; 
	НоваяФорма.ОписаниеОтчета				= "Утверждена Приказом Министерства финансов Российской Федерации от 04.10.2023 № 157н (с расшифровкой)";
	НоваяФорма.РедакцияФормы				= "от 04.10.2023 №157н (с расшифровкой)";
	НоваяФорма.ДатаНачалоДействия			= '20230101'; 
	НоваяФорма.ДатаКонецДействия			= КонсолидированнаяОтчетностьКлиентСервер.ПустоеЗначениеТипа(Тип("Дата"));
	
	
	Возврат ТаблицаФормОтчета;
	
КонецФункции

Функция ПолучитьНастройкиОтчетностиРСБУ(Организация, СчетДоверительногоУправления) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ДопСведенияСчетаДУ.СвойствоКлюч ЕСТЬ NULL
		|			ТОГДА _ДопСведенияОрганизации.СвойствоКлюч
		|		ИНАЧЕ _ДопСведенияСчетаДУ.СвойствоКлюч
		|	КОНЕЦ КАК СвойствоКлюч,
		|	_ДопСведенияСчетаДУ.Значение КАК ЗначениеСчетаДУ,
		|	_ДопСведенияОрганизации.Значение КАК ЗначениеОрганизации
		|ПОМЕСТИТЬ _ДопСведения
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЗначенияДополнительныхСведенийОрганизация.Свойство.Ключ КАК СвойствоКлюч,
		|		ЗначенияДополнительныхСведенийОрганизация.Значение КАК Значение
		|	ИЗ
		|		РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведенийОрганизация
		|	ГДЕ
		|		ЗначенияДополнительныхСведенийОрганизация.Свойство.ГруппаДополнительныхСведений.Ключ = ""ОтчетностьРСБУ""
		|		И ЗначенияДополнительныхСведенийОрганизация.Объект = &Организация) КАК _ДопСведенияОрганизации
		|		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЗначенияДополнительныхСведений.Свойство.Ключ КАК СвойствоКлюч,
		|			ЗначенияДополнительныхСведений.Значение КАК Значение
		|		ИЗ
		|			РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ГДЕ
		|			ЗначенияДополнительныхСведений.Свойство.ГруппаДополнительныхСведений.Ключ = ""ОтчетностьРСБУ""
		|			И ЗначенияДополнительныхСведений.Объект = &СчетДоверительногоУправления) КАК _ДопСведенияСчетаДУ
		|		ПО _ДопСведенияОрганизации.СвойствоКлюч = _ДопСведенияСчетаДУ.СвойствоКлюч
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВЫБОР
		|		КОГДА _ДопСведения.ЗначениеСчетаДУ ЕСТЬ NULL
		|			ТОГДА _ДопСведения.ЗначениеОрганизации
		|		ИНАЧЕ _ДопСведения.ЗначениеСчетаДУ
		|	КОНЕЦ КАК Значение,
		|	_ДопСведения.СвойствоКлюч КАК СвойствоКлюч
		|ПОМЕСТИТЬ _ФормироватьотУК
		|ИЗ
		|	_ДопСведения КАК _ДопСведения
		|ГДЕ
		|	_ДопСведения.СвойствоКлюч = ""ФормироватьОтУК""
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_ДопСведения.СвойствоКлюч КАК СвойствоКлюч,
		|	ВЫБОР
		|		КОГДА _ДопСведения.СвойствоКлюч = _ФормироватьотУК.СвойствоКлюч
		|			ТОГДА _ФормироватьотУК.Значение
		|		КОГДА _ФормироватьотУК.Значение = ИСТИНА
		|			ТОГДА _ДопСведения.ЗначениеОрганизации
		|		ИНАЧЕ ЕСТЬNULL(_ДопСведения.ЗначениеСчетаДУ, _ДопСведения.ЗначениеОрганизации)
		|	КОНЕЦ КАК Значение
		|ИЗ
		|	_ДопСведения КАК _ДопСведения,
		|	_ФормироватьотУК КАК _ФормироватьотУК";

	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", Организация);
		
	Возврат Запрос.Выполнить();
	
	
КонецФункции

#КонецЕсли

Функция СформироватьСписокРазделовОтчета(ИмяФормы = Неопределено, НКО = Ложь, ДатаФормирования = '20000101') Экспорт
	
	СписокРазделов = Новый СписокЗначений;
	
	ВыбраннаяФорма = СтрЗаменить(ИмяФормы, "Отчет.РегламентированныйОтчетБалансРСБУ.Форма.", "");    
	
	Если ВыбраннаяФорма = "ФормаОтчета_07100001" Тогда 
		СписокРазделов.Добавить("Баланс", "Баланс"); 
	ИначеЕсли ВыбраннаяФорма = "ФормаОтчета_07100001_2025" Тогда 
		СписокРазделов.Добавить("Баланс2025", "Баланс");
	ИначеЕсли ВыбраннаяФорма = "ФормаОтчета_07100001_2025СРасшифровкой" Тогда 
		СписокРазделов.Добавить("Баланс2025СРасшифровкой", "Баланс");
	КонецЕсли;
	
	Возврат СписокРазделов;
	
КонецФункции

Функция ПолучитьСтруктуруПараметров(ИмяФормы = Неопределено) Экспорт
	
	Результат = Новый Структура;
	
	Результат.Вставить("мВыбраннаяФорма");
	Результат.Вставить("мРедакцияФормы");
	Результат.Вставить("мСкопированаФорма");
	Результат.Вставить("мСохраненныйДок");
	Результат.Вставить("мДатаНачалаПериодаОтчета");
	Результат.Вставить("мДатаКонцаПериодаОтчета");
	Результат.Вставить("мЗаписываетсяНовыйДокумент");
	Результат.Вставить("мБезОткрытияФормы");
	Результат.Вставить("мРежимПечати");
	Результат.Вставить("мПредставлениеТекущегоПериода");
	Результат.Вставить("мПредставлениеПредыдущегоПериода");
	Результат.Вставить("мДатаНачалаПрошлогоПериодаОтчета");
	Результат.Вставить("мДатаКонцаПрошлогоПериодаОтчета");
	Результат.Вставить("мДелитель");
	Результат.Вставить("Организация");
	Результат.Вставить("СчетДоверительногоУправления");
	Результат.Вставить("ВидДеятельностиОрганизации");
	Результат.Вставить("ВалютаДокумента");
	Результат.Вставить("ЕдиницаИзмерения");
	Результат.Вставить("ТочностьЕдиницыИзмерения");
	Результат.Вставить("ОтчетНаКонецПрошлогоГода");
	Результат.Вставить("ОтчетНаКонецПозапрошлогоГода");
	Результат.Вставить("КодПоОКОПФ");
	Результат.Вставить("КодПоОКФС");
	Результат.Вставить("ФормироватьОтУК");
	Результат.Вставить("ЗаголовкиОтчетов");
	Результат.Вставить("СтрПериодОтчета");
	Результат.Вставить("НаимСчетаДоверительногоУправления");
	Результат.Вставить("НаимТекущегоРаздела");
	Результат.Вставить("ТекущаяСтрокаРазделовОтчета");
	Результат.Вставить("НестандартныйПериод");
		
	Возврат Результат;
	
КонецФункции
